# SheetMassUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..SheetMassUnit Property
FabricSheetType Class See Also
---
The sheet mass per area unit.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SheetMassUnit { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SheetMassUnit As Double
	Get
```

Visual C++
---
```text
public:
property double SheetMassUnit {
	double get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace